data_generation/Training_Cases/Case2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          76;
        startFace       260086;
    }
    outlet
    {
        type            patch;
        nFaces          162;
        startFace       260162;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       260324;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       260424;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1300;
        startFace       260524;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1386;
        startFace       261824;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(symmetry);
        nFaces          130824;
        startFace       263210;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(symmetry);
        nFaces          130824;
        startFace       394034;
    }
)

// ************************************************************************* //
